In [1]:
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
rates = pd.read_csv('./roman_exchange_rates_1729253897.csv')
transactions = pd.read_csv('./roman_transactions_1729253897.csv')

In [3]:
rates.describe()

       col_0           col_1    col_2
count   2202            2202     2202
unique    59            2202       21
top       CI  XXXIV-XII-XXIV  XXXVIII
freq     138               1      275

In [4]:
transactions.describe()

         col_0  col_1  col_2  col_3     col_4  col_5  col_6  col_7
count    20000  20000  20000  20000     20000  20000  20000  20000
unique       5      7     12    240         3     12     31   2023
top     Munarg  XXXIX    III   XXVI  Denarius     VI     II     IV
freq      8263   3367   1805    290     12009   4854    877    453